app/controllers/todos_controller.rb

  def update
    @todo.update_attributes params[:todo]
---
UPDATE "todos" SET "updated_at" = '2013-01-20 00:30:39.000000', "created_at" = '2013-01-20 00:30:39.000000', "status" = 'incomplete' WHERE "todos"."id" = 2

  def load_todo
    @todo = Todo.find params[:id]
---
SELECT "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT 1  [["id", "2"]]