app/controllers/tweets_controller.rb

UPDATE "tweets" SET "created_at" = '2013-03-09 14:33:49.000000', "status" = 1, "updated_at" = '2013-03-09 14:33:49.000000' WHERE "tweets"."id" = 3
---
  def update
    @tweet.update_attributes params[:tweet]

INSERT INTO "tweets" ("content", "created_at", "updated_at") VALUES (?, ?, ?)  [["content", "content1"], ["created_at", Sun, 20 Jan 2013 20:39:53 UTC +00:00], ["updated_at", Sun, 20 Jan 2013 20:39:53 UTC +00:00]]
---
  def create
    @tweet = Tweet.create params[:tweet]

SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT 1  [["id", "1"]]
---
  def load_tweet
    @tweet = Tweet.find params[:id]